uhnp/src/Catalogs/ЗаданияОтправкиИсходящихСообщений/ЗаданияОтправкиИсходящихСообщений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ЗаданияОтправкиИсходящихСообщений</name>
  <comment>Выполнение задач № 000035594</comment>
  <attributes>
    <name>СерверОчередей</name>
    <type>
      <types>CatalogRef.СерверыОчередейRMQ</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаПубликации</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтборСерверОчередей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтборТочкаПубликации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасписаниеЗадания</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЧислоПотоковОбработки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ИдентификаторыЗаданий</name>
    <attributes>
      <name>ИдентификаторЗадания</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Catalogs/ЗаданияОтправкиИсходящихСообщений/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЕстьОтборСерверОчередей Тогда
		ПроверяемыеРеквизиты.Добавить("СерверОчередей");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Отказ Тогда
		ОбновитьРегламентныеЗадания();
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьРегламентныеЗадания()
	
	МассивДействий = Новый Массив;
	Для Сч = 1 По ЧислоПотоковОбработки Цикл
		МассивДействий.Добавить("Создать");
	КонецЦикла;
	
	Для Сч = ЧислоПотоковОбработки+1 По ИдентификаторыЗаданий.Количество() Цикл
		МассивДействий.Добавить("Удалить");
	КонецЦикла;
	
	НомерСтроки = 0;
	УдаляемыеСтроки = Новый Массив;
	Для Каждого Действие Из МассивДействий Цикл
		Задание = Неопределено;
		Если НомерСтроки <= ИдентификаторыЗаданий.Количество()-1 Тогда
			СтрокаЗадания = ИдентификаторыЗаданий[НомерСтроки];
		Иначе
			СтрокаЗадания = ИдентификаторыЗаданий.Добавить();
		КонецЕсли;
		
		Если Действие = "Удалить" Тогда
			УдаляемыеСтроки.Добавить(СтрокаЗадания);
		Иначе
			Если ЗначениеЗаполнено(СтрокаЗадания.ИдентификаторЗадания) Тогда
				Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(СтрокаЗадания.ИдентификаторЗадания);
			КонецЕсли;
			
			Если Задание = Неопределено Тогда
				МетаданноеРегламентного = Метаданные.РегламентныеЗадания.ОтправкаИсходящихСообщений;
				Задание = РегламентныеЗадания.СоздатьРегламентноеЗадание(МетаданноеРегламентного);
				СтрокаЗадания.ИдентификаторЗадания = Задание.УникальныйИдентификатор;
			КонецЕсли;
			
			Задание.Наименование = Наименование + "(" + (НомерСтроки+1) + ")";
			Задание.Расписание = РасписаниеЗадания.Получить();
			Задание.Использование = Не ПометкаУдаления;
			Задание.Ключ = ""+Код+НомерСтроки;
			
			ПараметрыЗадания = Новый Массив;
			ПараметрыЗадания.Добавить(?(ЕстьОтборСерверОчередей, СерверОчередей, Неопределено));
			// НАЧАЛО Калинин А. 02.10.2019 Выполнение задач №000033040
			//ПараметрыЗадания.Добавить(?(ЕстьОтборСерверОчередей, СерверОчередей, Неопределено));
			ПараметрыЗадания.Добавить(?(ЕстьОтборТочкаПубликации, ТочкаПубликации, Неопределено));
			// КОНЕЦ Калинин А. 02.10.2019 Выполнение задач №000033040
			
			Задание.Параметры = ПараметрыЗадания;
			
			Задание.Записать();
		КонецЕсли;
		
		НомерСтроки = НомерСтроки + 1;
		
	КонецЦикла;
	
	Для Каждого СтрокаЗадания Из УдаляемыеСтроки Цикл
		Если ЗначениеЗаполнено(СтрокаЗадания.ИдентификаторЗадания) Тогда
			Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(СтрокаЗадания.ИдентификаторЗадания);
		КонецЕсли;
		Если Задание <> Неопределено Тогда
			Задание.Удалить();
		КонецЕсли;	
		ИдентификаторыЗаданий.Удалить(СтрокаЗадания);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Для Каждого СтрЗадания Из ИдентификаторыЗаданий Цикл
		Если ЗначениеЗаполнено(СтрЗадания.ИдентификаторЗадания) Тогда
			Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(СтрЗадания.ИдентификаторЗадания);
			Если Задание <> Неопределено Тогда
				Задание.Удалить();
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	ИдентификаторыЗаданий.Очистить();
КонецПроцедуры
